
## :x: Apply Result

[CI link](https://github.com/rindrics-sandbox-org/terraform-operations/actions/runs/11921848906)

@ Please check the error.

It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
21:11:52.124 INFO   The stack at . will be processed in the following order for command init:
Group 1
- Module .


21:11:52.355 STDOUT terraform: Initializing the backend...
21:11:52.381 STDOUT terraform: Initializing modules...
21:11:52.382 STDOUT terraform: Initializing provider plugins...
21:11:52.383 STDOUT terraform: - Reusing previous version of hashicorp/null from the dependency lock file
21:11:52.415 STDOUT terraform: - Reusing previous version of integrations/github from the dependency lock file
21:11:52.441 STDOUT terraform: - Using previously-installed integrations/github v6.3.1
21:11:52.451 STDOUT terraform: - Using previously-installed hashicorp/null v3.2.3
21:11:52.451 STDOUT terraform: Terraform has been successfully initialized!
21:11:52.452 STDOUT terraform: 
21:11:52.452 STDOUT terraform: You may now begin working with Terraform. Try running "terraform plan" to see
21:11:52.452 STDOUT terraform: any changes that are required for your infrastructure. All Terraform commands
21:11:52.452 STDOUT terraform: should now work.
21:11:52.452 STDOUT terraform: If you ever set or change modules or backend configuration for Terraform,
21:11:52.452 STDOUT terraform: rerun this command to reinitialize your working directory. If you forget, other
21:11:52.452 STDOUT terraform: commands will detect it and remind you to do so if necessary.
1063347
57353172
21:11:52.503 INFO   The stack at . will be processed in the following order for command validate:
Group 1
- Module .


21:11:52.930 STDOUT terraform: Success! The configuration is valid.
21:11:52.930 STDOUT terraform: 
21:11:52.984 INFO   The stack at . will be processed in the following order for command plan:
Group 1
- Module .


21:11:53.670 STDOUT terraform: github_repository.terraform_state_files: Preparing import... [id=terraform-state-files]
21:11:53.670 STDOUT terraform: github_repository.terraform_operations: Preparing import... [id=github-terraform-examples]
21:11:53.672 STDOUT terraform: module.security.data.github_user.this["Rindrics"]: Reading...
21:11:53.672 STDOUT terraform: github_repository.terraform_state_files: Refreshing state... [id=terraform-state-files]
21:11:53.672 STDOUT terraform: github_repository.terraform_operations: Refreshing state... [id=github-terraform-examples]
21:11:54.674 STDOUT terraform: module.security.data.github_user.this["Rindrics"]: Read complete after 1s [id=14845847]
21:11:54.677 STDOUT terraform: github_membership.org_owner["Rindrics"]: Preparing import... [id=rindrics-sandbox-org:Rindrics]
21:11:54.677 STDOUT terraform: github_membership.org_owner["Rindrics"]: Refreshing state... [id=rindrics-sandbox-org:Rindrics]
21:11:54.877 STDOUT terraform: Terraform used the selected providers to generate the following execution
21:11:54.877 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
21:11:54.878 STDOUT terraform:   + create
21:11:54.878 STDOUT terraform:   ~ update in-place
21:11:54.878 STDOUT terraform: Terraform will perform the following actions:
21:11:54.878 STDOUT terraform:   # github_membership.org_owner["Rindrics"] will be imported
21:11:54.878 STDOUT terraform:     resource "github_membership" "org_owner" {
21:11:54.878 STDOUT terraform:         etag     = "W/\"2e4bcb9ac0e80ba0650ee8adcd7e3dd248ccb0be0e7ebc0786b57b6bde58c3ce\""
21:11:54.878 STDOUT terraform:         id       = "rindrics-sandbox-org:Rindrics"
21:11:54.878 STDOUT terraform:         role     = "admin"
21:11:54.878 STDOUT terraform:         username = "Rindrics"
21:11:54.878 STDOUT terraform:     }
21:11:54.878 STDOUT terraform:   # github_repository.all_in_one["bar"] will be created
21:11:54.878 STDOUT terraform:   + resource "github_repository" "all_in_one" {
21:11:54.878 STDOUT terraform:       + allow_auto_merge            = false
21:11:54.878 STDOUT terraform:       + allow_merge_commit          = true
21:11:54.878 STDOUT terraform:       + allow_rebase_merge          = true
21:11:54.878 STDOUT terraform:       + allow_squash_merge          = true
21:11:54.879 STDOUT terraform:       + archived                    = false
21:11:54.879 STDOUT terraform:       + default_branch              = (known after apply)
21:11:54.879 STDOUT terraform:       + delete_branch_on_merge      = false
21:11:54.879 STDOUT terraform:       + etag                        = (known after apply)
21:11:54.879 STDOUT terraform:       + full_name                   = (known after apply)
21:11:54.879 STDOUT terraform:       + git_clone_url               = (known after apply)
21:11:54.879 STDOUT terraform:       + html_url                    = (known after apply)
21:11:54.879 STDOUT terraform:       + http_clone_url              = (known after apply)
21:11:54.879 STDOUT terraform:       + id                          = (known after apply)
21:11:54.879 STDOUT terraform:       + merge_commit_message        = "PR_TITLE"
21:11:54.879 STDOUT terraform:       + merge_commit_title          = "MERGE_MESSAGE"
21:11:54.879 STDOUT terraform:       + name                        = "bar"
21:11:54.879 STDOUT terraform:       + node_id                     = (known after apply)
21:11:54.879 STDOUT terraform:       + primary_language            = (known after apply)
21:11:54.879 STDOUT terraform:       + private                     = (known after apply)
21:11:54.879 STDOUT terraform:       + repo_id                     = (known after apply)
21:11:54.879 STDOUT terraform:       + squash_merge_commit_message = "COMMIT_MESSAGES"
21:11:54.879 STDOUT terraform:       + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
21:11:54.879 STDOUT terraform:       + ssh_clone_url               = (known after apply)
21:11:54.879 STDOUT terraform:       + svn_url                     = (known after apply)
21:11:54.879 STDOUT terraform:       + topics                      = (known after apply)
21:11:54.879 STDOUT terraform:       + visibility                  = "public"
21:11:54.879 STDOUT terraform:       + web_commit_signoff_required = false
21:11:54.879 STDOUT terraform:       + security_and_analysis (known after apply)
21:11:54.879 STDOUT terraform:     }
21:11:54.879 STDOUT terraform:   # github_repository.all_in_one["baz"] will be created
21:11:54.879 STDOUT terraform:   + resource "github_repository" "all_in_one" {
21:11:54.879 STDOUT terraform:       + allow_auto_merge            = false
21:11:54.879 STDOUT terraform:       + allow_merge_commit          = true
21:11:54.879 STDOUT terraform:       + allow_rebase_merge          = true
21:11:54.879 STDOUT terraform:       + allow_squash_merge          = true
21:11:54.879 STDOUT terraform:       + archived                    = false
21:11:54.879 STDOUT terraform:       + default_branch              = (known after apply)
21:11:54.880 STDOUT terraform:       + delete_branch_on_merge      = false
21:11:54.880 STDOUT terraform:       + etag                        = (known after apply)
21:11:54.880 STDOUT terraform:       + full_name                   = (known after apply)
21:11:54.880 STDOUT terraform:       + git_clone_url               = (known after apply)
21:11:54.880 STDOUT terraform:       + html_url                    = (known after apply)
21:11:54.880 STDOUT terraform:       + http_clone_url              = (known after apply)
21:11:54.880 STDOUT terraform:       + id                          = (known after apply)
21:11:54.880 STDOUT terraform:       + merge_commit_message        = "PR_TITLE"
21:11:54.880 STDOUT terraform:       + merge_commit_title          = "MERGE_MESSAGE"
21:11:54.880 STDOUT terraform:       + name                        = "baz"
21:11:54.880 STDOUT terraform:       + node_id                     = (known after apply)
21:11:54.880 STDOUT terraform:       + primary_language            = (known after apply)
21:11:54.880 STDOUT terraform:       + private                     = (known after apply)
21:11:54.880 STDOUT terraform:       + repo_id                     = (known after apply)
21:11:54.880 STDOUT terraform:       + squash_merge_commit_message = "COMMIT_MESSAGES"
21:11:54.880 STDOUT terraform:       + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
21:11:54.880 STDOUT terraform:       + ssh_clone_url               = (known after apply)
21:11:54.880 STDOUT terraform:       + svn_url                     = (known after apply)
21:11:54.880 STDOUT terraform:       + topics                      = (known after apply)
21:11:54.880 STDOUT terraform:       + visibility                  = "public"
21:11:54.880 STDOUT terraform:       + web_commit_signoff_required = false
21:11:54.880 STDOUT terraform:       + security_and_analysis (known after apply)
21:11:54.880 STDOUT terraform:     }
21:11:54.880 STDOUT terraform:   # github_repository.all_in_one["foo"] will be created
21:11:54.880 STDOUT terraform:   + resource "github_repository" "all_in_one" {
21:11:54.880 STDOUT terraform:       + allow_auto_merge            = false
21:11:54.880 STDOUT terraform:       + allow_merge_commit          = true
21:11:54.880 STDOUT terraform:       + allow_rebase_merge          = true
21:11:54.880 STDOUT terraform:       + allow_squash_merge          = true
21:11:54.880 STDOUT terraform:       + archived                    = false
21:11:54.880 STDOUT terraform:       + default_branch              = (known after apply)
21:11:54.880 STDOUT terraform:       + delete_branch_on_merge      = false
21:11:54.880 STDOUT terraform:       + etag                        = (known after apply)
21:11:54.880 STDOUT terraform:       + full_name                   = (known after apply)
21:11:54.881 STDOUT terraform:       + git_clone_url               = (known after apply)
21:11:54.881 STDOUT terraform:       + html_url                    = (known after apply)
21:11:54.881 STDOUT terraform:       + http_clone_url              = (known after apply)
21:11:54.881 STDOUT terraform:       + id                          = (known after apply)
21:11:54.881 STDOUT terraform:       + merge_commit_message        = "PR_TITLE"
21:11:54.881 STDOUT terraform:       + merge_commit_title          = "MERGE_MESSAGE"
21:11:54.881 STDOUT terraform:       + name                        = "foo"
21:11:54.881 STDOUT terraform:       + node_id                     = (known after apply)
21:11:54.881 STDOUT terraform:       + primary_language            = (known after apply)
21:11:54.881 STDOUT terraform:       + private                     = (known after apply)
21:11:54.881 STDOUT terraform:       + repo_id                     = (known after apply)
21:11:54.881 STDOUT terraform:       + squash_merge_commit_message = "COMMIT_MESSAGES"
21:11:54.881 STDOUT terraform:       + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
21:11:54.881 STDOUT terraform:       + ssh_clone_url               = (known after apply)
21:11:54.881 STDOUT terraform:       + svn_url                     = (known after apply)
21:11:54.881 STDOUT terraform:       + topics                      = (known after apply)
21:11:54.881 STDOUT terraform:       + visibility                  = "public"
21:11:54.881 STDOUT terraform:       + web_commit_signoff_required = false
21:11:54.881 STDOUT terraform:       + security_and_analysis (known after apply)
21:11:54.881 STDOUT terraform:     }
21:11:54.881 STDOUT terraform:   # github_repository.terraform_operations will be updated in-place
21:11:54.881 STDOUT terraform:   # (imported from "github-terraform-examples")
21:11:54.881 STDOUT terraform:   ~ resource "github_repository" "terraform_operations" {
21:11:54.881 STDOUT terraform:         allow_auto_merge            = false
21:11:54.881 STDOUT terraform:         allow_merge_commit          = true
21:11:54.881 STDOUT terraform:         allow_rebase_merge          = true
21:11:54.881 STDOUT terraform:         allow_squash_merge          = true
21:11:54.881 STDOUT terraform:         allow_update_branch         = false
21:11:54.881 STDOUT terraform:         archived                    = false
21:11:54.881 STDOUT terraform:         auto_init                   = false
21:11:54.881 STDOUT terraform:         default_branch              = "main"
21:11:54.881 STDOUT terraform:         delete_branch_on_merge      = true
21:11:54.882 STDOUT terraform:         description                 = "Organization 配下のリソースを管理する Terraform ソースの置き場所"
21:11:54.882 STDOUT terraform:         etag                        = "W/\"89da18187f167bead7c82b88e99640e6c142fd5b63724fa0eb076544becfd911\""
21:11:54.882 STDOUT terraform:       ~ full_name                   = "rindrics-sandbox-org/terraform-operations" -> (known after apply)
21:11:54.882 STDOUT terraform:         git_clone_url               = "git://github.com/rindrics-sandbox-org/terraform-operations.git"
21:11:54.882 STDOUT terraform:         has_discussions             = false
21:11:54.882 STDOUT terraform:         has_downloads               = false
21:11:54.882 STDOUT terraform:         has_issues                  = true
21:11:54.882 STDOUT terraform:         has_projects                = false
21:11:54.882 STDOUT terraform:         has_wiki                    = false
21:11:54.882 STDOUT terraform:         homepage_url                = null
21:11:54.882 STDOUT terraform:         html_url                    = "https://github.com/rindrics-sandbox-org/terraform-operations"
21:11:54.882 STDOUT terraform:         http_clone_url              = "https://github.com/rindrics-sandbox-org/terraform-operations.git"
21:11:54.882 STDOUT terraform:         id                          = "github-terraform-examples"
21:11:54.882 STDOUT terraform:         is_template                 = false
21:11:54.882 STDOUT terraform:         merge_commit_message        = "PR_TITLE"
21:11:54.883 STDOUT terraform:         merge_commit_title          = "MERGE_MESSAGE"
21:11:54.883 STDOUT terraform:       ~ name                        = "github-terraform-examples" -> "terraform-operations"
21:11:54.883 STDOUT terraform:         node_id                     = "R_kgDONRuOGQ"
21:11:54.883 STDOUT terraform:         primary_language            = "HCL"
21:11:54.883 STDOUT terraform:         private                     = false
21:11:54.883 STDOUT terraform:         repo_id                     = 890998297
21:11:54.883 STDOUT terraform:         squash_merge_commit_message = "COMMIT_MESSAGES"
21:11:54.883 STDOUT terraform:         squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
21:11:54.883 STDOUT terraform:         ssh_clone_url               = "git@github.com:rindrics-sandbox-org/terraform-operations.git"
21:11:54.883 STDOUT terraform:         svn_url                     = "https://github.com/rindrics-sandbox-org/terraform-operations"
21:11:54.883 STDOUT terraform:         topics                      = []
21:11:54.883 STDOUT terraform:         visibility                  = "public"
21:11:54.883 STDOUT terraform:         vulnerability_alerts        = true
21:11:54.883 STDOUT terraform:         web_commit_signoff_required = false
21:11:54.883 STDOUT terraform:         security_and_analysis {
21:11:54.883 STDOUT terraform:             secret_scanning {
21:11:54.883 STDOUT terraform:                 status = "disabled"
21:11:54.883 STDOUT terraform:             }
21:11:54.883 STDOUT terraform:             secret_scanning_push_protection {
21:11:54.884 STDOUT terraform:                 status = "disabled"
21:11:54.884 STDOUT terraform:             }
21:11:54.884 STDOUT terraform:         }
21:11:54.884 STDOUT terraform:     }
21:11:54.884 STDOUT terraform:   # github_repository.terraform_state_files will be imported
21:11:54.884 STDOUT terraform:     resource "github_repository" "terraform_state_files" {
21:11:54.884 STDOUT terraform:         allow_auto_merge            = false
21:11:54.884 STDOUT terraform:         allow_merge_commit          = true
21:11:54.884 STDOUT terraform:         allow_rebase_merge          = true
21:11:54.884 STDOUT terraform:         allow_squash_merge          = true
21:11:54.884 STDOUT terraform:         allow_update_branch         = false
21:11:54.884 STDOUT terraform:         archived                    = false
21:11:54.884 STDOUT terraform:         auto_init                   = false
21:11:54.884 STDOUT terraform:         default_branch              = "main"
21:11:54.884 STDOUT terraform:         delete_branch_on_merge      = false
21:11:54.884 STDOUT terraform:         description                 = "リポジトリ `github-operations` の GitHub Actions から利用される Terraform state file を保管する"
21:11:54.884 STDOUT terraform:         etag                        = "W/\"c3d9bb8936b3c0cc5118345dba911909dd906c938ddb40867121de70a41336bb\""
21:11:54.885 STDOUT terraform:         full_name                   = "rindrics-sandbox-org/terraform-state-files"
21:11:54.885 STDOUT terraform:         git_clone_url               = "git://github.com/rindrics-sandbox-org/terraform-state-files.git"
21:11:54.885 STDOUT terraform:         has_discussions             = false
21:11:54.885 STDOUT terraform:         has_downloads               = false
21:11:54.885 STDOUT terraform:         has_issues                  = false
21:11:54.885 STDOUT terraform:         has_projects                = false
21:11:54.885 STDOUT terraform:         has_wiki                    = false
21:11:54.885 STDOUT terraform:         homepage_url                = null
21:11:54.885 STDOUT terraform:         html_url                    = "https://github.com/rindrics-sandbox-org/terraform-state-files"
21:11:54.885 STDOUT terraform:         http_clone_url              = "https://github.com/rindrics-sandbox-org/terraform-state-files.git"
21:11:54.885 STDOUT terraform:         id                          = "terraform-state-files"
21:11:54.885 STDOUT terraform:         is_template                 = false
21:11:54.885 STDOUT terraform:         merge_commit_message        = "PR_TITLE"
21:11:54.885 STDOUT terraform:         merge_commit_title          = "MERGE_MESSAGE"
21:11:54.885 STDOUT terraform:         name                        = "terraform-state-files"
21:11:54.885 STDOUT terraform:         node_id                     = "R_kgDONRu-jA"
21:11:54.885 STDOUT terraform:         primary_language            = null
21:11:54.886 STDOUT terraform:         private                     = true
21:11:54.886 STDOUT terraform:         repo_id                     = 891010700
21:11:54.886 STDOUT terraform:         squash_merge_commit_message = "COMMIT_MESSAGES"
21:11:54.886 STDOUT terraform:         squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
21:11:54.886 STDOUT terraform:         ssh_clone_url               = "git@github.com:rindrics-sandbox-org/terraform-state-files.git"
21:11:54.886 STDOUT terraform:         svn_url                     = "https://github.com/rindrics-sandbox-org/terraform-state-files"
21:11:54.886 STDOUT terraform:         topics                      = []
21:11:54.886 STDOUT terraform:         visibility                  = "private"
21:11:54.886 STDOUT terraform:         vulnerability_alerts        = true
21:11:54.886 STDOUT terraform:         web_commit_signoff_required = false
21:11:54.886 STDOUT terraform:     }
21:11:54.886 STDOUT terraform:   # github_team.all_in_one["team-1"] will be created
21:11:54.886 STDOUT terraform:   + resource "github_team" "all_in_one" {
21:11:54.886 STDOUT terraform:       + create_default_maintainer = false
21:11:54.886 STDOUT terraform:       + etag                      = (known after apply)
21:11:54.886 STDOUT terraform:       + id                        = (known after apply)
21:11:54.886 STDOUT terraform:       + members_count             = (known after apply)
21:11:54.886 STDOUT terraform:       + name                      = "team-1"
21:11:54.887 STDOUT terraform:       + node_id                   = (known after apply)
21:11:54.887 STDOUT terraform:       + parent_team_read_id       = (known after apply)
21:11:54.887 STDOUT terraform:       + parent_team_read_slug     = (known after apply)
21:11:54.887 STDOUT terraform:       + privacy                   = "closed"
21:11:54.887 STDOUT terraform:       + slug                      = (known after apply)
21:11:54.887 STDOUT terraform:     }
21:11:54.887 STDOUT terraform:   # github_team.all_in_one["team-2"] will be created
21:11:54.887 STDOUT terraform:   + resource "github_team" "all_in_one" {
21:11:54.887 STDOUT terraform:       + create_default_maintainer = false
21:11:54.887 STDOUT terraform:       + etag                      = (known after apply)
21:11:54.887 STDOUT terraform:       + id                        = (known after apply)
21:11:54.887 STDOUT terraform:       + members_count             = (known after apply)
21:11:54.887 STDOUT terraform:       + name                      = "team-2"
21:11:54.887 STDOUT terraform:       + node_id                   = (known after apply)
21:11:54.887 STDOUT terraform:       + parent_team_read_id       = (known after apply)
21:11:54.887 STDOUT terraform:       + parent_team_read_slug     = (known after apply)
21:11:54.887 STDOUT terraform:       + privacy                   = "closed"
21:11:54.887 STDOUT terraform:       + slug                      = (known after apply)
21:11:54.887 STDOUT terraform:     }
21:11:54.887 STDOUT terraform:   # github_team.all_in_one["team-3"] will be created
21:11:54.888 STDOUT terraform:   + resource "github_team" "all_in_one" {
21:11:54.888 STDOUT terraform:       + create_default_maintainer = false
21:11:54.888 STDOUT terraform:       + etag                      = (known after apply)
21:11:54.888 STDOUT terraform:       + id                        = (known after apply)
21:11:54.888 STDOUT terraform:       + members_count             = (known after apply)
21:11:54.888 STDOUT terraform:       + name                      = "team-3"
21:11:54.888 STDOUT terraform:       + node_id                   = (known after apply)
21:11:54.888 STDOUT terraform:       + parent_team_read_id       = (known after apply)
21:11:54.888 STDOUT terraform:       + parent_team_read_slug     = (known after apply)
21:11:54.888 STDOUT terraform:       + privacy                   = "closed"
21:11:54.888 STDOUT terraform:       + slug                      = (known after apply)
21:11:54.888 STDOUT terraform:     }
21:11:54.888 STDOUT terraform:   # github_team.all_in_one["team-4"] will be created
21:11:54.888 STDOUT terraform:   + resource "github_team" "all_in_one" {
21:11:54.888 STDOUT terraform:       + create_default_maintainer = false
21:11:54.888 STDOUT terraform:       + etag                      = (known after apply)
21:11:54.888 STDOUT terraform:       + id                        = (known after apply)
21:11:54.888 STDOUT terraform:       + members_count             = (known after apply)
21:11:54.888 STDOUT terraform:       + name                      = "team-4"
21:11:54.889 STDOUT terraform:       + node_id                   = (known after apply)
21:11:54.889 STDOUT terraform:       + parent_team_read_id       = (known after apply)
21:11:54.889 STDOUT terraform:       + parent_team_read_slug     = (known after apply)
21:11:54.889 STDOUT terraform:       + privacy                   = "closed"
21:11:54.889 STDOUT terraform:       + slug                      = (known after apply)
21:11:54.889 STDOUT terraform:     }
21:11:54.889 STDOUT terraform:   # github_team.all_in_one["team-5"] will be created
21:11:54.889 STDOUT terraform:   + resource "github_team" "all_in_one" {
21:11:54.889 STDOUT terraform:       + create_default_maintainer = false
21:11:54.889 STDOUT terraform:       + etag                      = (known after apply)
21:11:54.889 STDOUT terraform:       + id                        = (known after apply)
21:11:54.889 STDOUT terraform:       + members_count             = (known after apply)
21:11:54.889 STDOUT terraform:       + name                      = "team-5"
21:11:54.889 STDOUT terraform:       + node_id                   = (known after apply)
21:11:54.889 STDOUT terraform:       + parent_team_read_id       = (known after apply)
21:11:54.889 STDOUT terraform:       + parent_team_read_slug     = (known after apply)
21:11:54.889 STDOUT terraform:       + privacy                   = "closed"
21:11:54.889 STDOUT terraform:       + slug                      = (known after apply)
21:11:54.889 STDOUT terraform:     }
21:11:54.889 STDOUT terraform:   # github_team_membership.all_in_one["team-1"] will be created
21:11:54.889 STDOUT terraform:   + resource "github_team_membership" "all_in_one" {
21:11:54.889 STDOUT terraform:       + etag     = (known after apply)
21:11:54.889 STDOUT terraform:       + id       = (known after apply)
21:11:54.889 STDOUT terraform:       + role     = "maintainer"
21:11:54.889 STDOUT terraform:       + team_id  = "team-1"
21:11:54.890 STDOUT terraform:       + username = "Rindrics"
21:11:54.890 STDOUT terraform:     }
21:11:54.890 STDOUT terraform:   # github_team_membership.all_in_one["team-2"] will be created
21:11:54.890 STDOUT terraform:   + resource "github_team_membership" "all_in_one" {
21:11:54.890 STDOUT terraform:       + etag     = (known after apply)
21:11:54.890 STDOUT terraform:       + id       = (known after apply)
21:11:54.890 STDOUT terraform:       + role     = "maintainer"
21:11:54.890 STDOUT terraform:       + team_id  = "team-2"
21:11:54.890 STDOUT terraform:       + username = "Rindrics"
21:11:54.890 STDOUT terraform:     }
21:11:54.890 STDOUT terraform:   # github_team_membership.all_in_one["team-3"] will be created
21:11:54.890 STDOUT terraform:   + resource "github_team_membership" "all_in_one" {
21:11:54.890 STDOUT terraform:       + etag     = (known after apply)
21:11:54.890 STDOUT terraform:       + id       = (known after apply)
21:11:54.890 STDOUT terraform:       + role     = "maintainer"
21:11:54.890 STDOUT terraform:       + team_id  = "team-3"
21:11:54.890 STDOUT terraform:       + username = "Rindrics"
21:11:54.890 STDOUT terraform:     }
21:11:54.890 STDOUT terraform:   # github_team_membership.all_in_one["team-4"] will be created
21:11:54.890 STDOUT terraform:   + resource "github_team_membership" "all_in_one" {
21:11:54.890 STDOUT terraform:       + etag     = (known after apply)
21:11:54.890 STDOUT terraform:       + id       = (known after apply)
21:11:54.890 STDOUT terraform:       + role     = "maintainer"
21:11:54.890 STDOUT terraform:       + team_id  = "team-4"
21:11:54.890 STDOUT terraform:       + username = "Rindrics"
21:11:54.890 STDOUT terraform:     }
21:11:54.890 STDOUT terraform:   # github_team_membership.all_in_one["team-5"] will be created
21:11:54.890 STDOUT terraform:   + resource "github_team_membership" "all_in_one" {
21:11:54.890 STDOUT terraform:       + etag     = (known after apply)
21:11:54.890 STDOUT terraform:       + id       = (known after apply)
21:11:54.890 STDOUT terraform:       + role     = "maintainer"
21:11:54.890 STDOUT terraform:       + team_id  = "team-5"
21:11:54.890 STDOUT terraform:       + username = "Rindrics"
21:11:54.890 STDOUT terraform:     }
21:11:54.890 STDOUT terraform:   # github_team_repository.all_in_one["team-1:foo"] will be created
21:11:54.890 STDOUT terraform:   + resource "github_team_repository" "all_in_one" {
21:11:54.890 STDOUT terraform:       + etag       = (known after apply)
21:11:54.890 STDOUT terraform:       + id         = (known after apply)
21:11:54.890 STDOUT terraform:       + permission = "maintain"
21:11:54.890 STDOUT terraform:       + repository = "foo"
21:11:54.890 STDOUT terraform:       + team_id    = (known after apply)
21:11:54.890 STDOUT terraform:     }
21:11:54.890 STDOUT terraform:   # github_team_repository.all_in_one["team-2:baz"] will be created
21:11:54.891 STDOUT terraform:   + resource "github_team_repository" "all_in_one" {
21:11:54.891 STDOUT terraform:       + etag       = (known after apply)
21:11:54.891 STDOUT terraform:       + id         = (known after apply)
21:11:54.891 STDOUT terraform:       + permission = "maintain"
21:11:54.891 STDOUT terraform:       + repository = "baz"
21:11:54.891 STDOUT terraform:       + team_id    = (known after apply)
21:11:54.891 STDOUT terraform:     }
21:11:54.891 STDOUT terraform:   # github_team_repository.all_in_one["team-2:foo"] will be created
21:11:54.891 STDOUT terraform:   + resource "github_team_repository" "all_in_one" {
21:11:54.891 STDOUT terraform:       + etag       = (known after apply)
21:11:54.891 STDOUT terraform:       + id         = (known after apply)
21:11:54.891 STDOUT terraform:       + permission = "maintain"
21:11:54.891 STDOUT terraform:       + repository = "foo"
21:11:54.891 STDOUT terraform:       + team_id    = (known after apply)
21:11:54.891 STDOUT terraform:     }
21:11:54.891 STDOUT terraform:   # github_team_repository.all_in_one["team-3:bar"] will be created
21:11:54.891 STDOUT terraform:   + resource "github_team_repository" "all_in_one" {
21:11:54.891 STDOUT terraform:       + etag       = (known after apply)
21:11:54.891 STDOUT terraform:       + id         = (known after apply)
21:11:54.891 STDOUT terraform:       + permission = "maintain"
21:11:54.891 STDOUT terraform:       + repository = "bar"
21:11:54.891 STDOUT terraform:       + team_id    = (known after apply)
21:11:54.891 STDOUT terraform:     }
21:11:54.891 STDOUT terraform:   # github_team_repository.all_in_one["team-3:baz"] will be created
21:11:54.891 STDOUT terraform:   + resource "github_team_repository" "all_in_one" {
21:11:54.891 STDOUT terraform:       + etag       = (known after apply)
21:11:54.891 STDOUT terraform:       + id         = (known after apply)
21:11:54.891 STDOUT terraform:       + permission = "maintain"
21:11:54.891 STDOUT terraform:       + repository = "baz"
21:11:54.891 STDOUT terraform:       + team_id    = (known after apply)
21:11:54.891 STDOUT terraform:     }
21:11:54.891 STDOUT terraform:   # github_team_repository.all_in_one["team-3:foo"] will be created
21:11:54.891 STDOUT terraform:   + resource "github_team_repository" "all_in_one" {
21:11:54.891 STDOUT terraform:       + etag       = (known after apply)
21:11:54.891 STDOUT terraform:       + id         = (known after apply)
21:11:54.891 STDOUT terraform:       + permission = "maintain"
21:11:54.891 STDOUT terraform:       + repository = "foo"
21:11:54.891 STDOUT terraform:       + team_id    = (known after apply)
21:11:54.891 STDOUT terraform:     }
21:11:54.891 STDOUT terraform:   # github_team_repository.all_in_one["team-4:baz"] will be created
21:11:54.892 STDOUT terraform:   + resource "github_team_repository" "all_in_one" {
21:11:54.892 STDOUT terraform:       + etag       = (known after apply)
21:11:54.892 STDOUT terraform:       + id         = (known after apply)
21:11:54.892 STDOUT terraform:       + permission = "maintain"
21:11:54.892 STDOUT terraform:       + repository = "baz"
21:11:54.892 STDOUT terraform:       + team_id    = (known after apply)
21:11:54.892 STDOUT terraform:     }
21:11:54.892 STDOUT terraform:   # github_team_repository.all_in_one["team-5:bar"] will be created
21:11:54.892 STDOUT terraform:   + resource "github_team_repository" "all_in_one" {
21:11:54.892 STDOUT terraform:       + etag       = (known after apply)
21:11:54.892 STDOUT terraform:       + id         = (known after apply)
21:11:54.892 STDOUT terraform:       + permission = "maintain"
21:11:54.892 STDOUT terraform:       + repository = "bar"
21:11:54.892 STDOUT terraform:       + team_id    = (known after apply)
21:11:54.892 STDOUT terraform:     }
21:11:54.892 STDOUT terraform:   # github_team_repository.all_in_one["team-5:baz"] will be created
21:11:54.892 STDOUT terraform:   + resource "github_team_repository" "all_in_one" {
21:11:54.892 STDOUT terraform:       + etag       = (known after apply)
21:11:54.892 STDOUT terraform:       + id         = (known after apply)
21:11:54.892 STDOUT terraform:       + permission = "maintain"
21:11:54.892 STDOUT terraform:       + repository = "baz"
21:11:54.892 STDOUT terraform:       + team_id    = (known after apply)
21:11:54.892 STDOUT terraform:     }
21:11:54.892 STDOUT terraform:   # github_team_repository.all_in_one["team-5:foo"] will be created
21:11:54.892 STDOUT terraform:   + resource "github_team_repository" "all_in_one" {
21:11:54.892 STDOUT terraform:       + etag       = (known after apply)
21:11:54.892 STDOUT terraform:       + id         = (known after apply)
21:11:54.892 STDOUT terraform:       + permission = "maintain"
21:11:54.892 STDOUT terraform:       + repository = "foo"
21:11:54.892 STDOUT terraform:       + team_id    = (known after apply)
21:11:54.892 STDOUT terraform:     }
21:11:54.892 STDOUT terraform: Plan: 3 to import, 23 to add, 1 to change, 0 to destroy.
21:11:54.892 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
21:11:54.892 STDOUT terraform: Saved the plan to: .terraform/terraform.plan
21:11:54.892 STDOUT terraform: To perform exactly these actions, run the following command to apply:
21:11:54.892 STDOUT terraform:     terraform apply ".terraform/terraform.plan"
21:11:54.939 INFO   The stack at . will be processed in the following order for command apply:
Group 1
- Module .


Are you sure you want to run 'terragrunt apply' in each folder of the stack described above? (y/n) 21:11:54.939 ERROR  EOF
21:11:54.940 ERROR  Unable to determine underlying exit code, so Terragrunt will exit with error code 1
make: *** [Makefile:35: apply-force] Error 1

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform_apply","PRNumber":7,"Program":"tfcmt","SHA1":"8c7a5526782f8b5774b89162ffbc4f80bd1fc1ff","Vars":{},"WorkflowName":"terraform-apply"} -->